In [1]:
import pandas as pd

In [6]:
df1 = pd.DataFrame([('JAN','8100',20),('FEB','8100',5)],
                  columns=['Month','Book','Units'])
df1

  Month  Book  Units
0   JAN  8100     20
1   FEB  8100      5

In [9]:
df2 = pd.DataFrame([('MAR','8500',30),('APR','8600',7)],
                  columns=['Month','Book','Units'])

df2

  Month  Book  Units
0   MAR  8500     30
1   APR  8600      7

In [12]:
pd.concat([df1,df2],ignore_index=True)

  Month  Book  Units
0   JAN  8100     20
1   FEB  8100      5
2   MAR  8500     30
3   APR  8600      7

In [14]:
df1 = pd.DataFrame({'name' : ['A','B','C'],'age':[20,30,25]})
df1

  name  age
0    A   20
1    B   30
2    C   25

In [16]:
df2 = pd.DataFrame({'name' : ['A','B','D'],'gender':['M','F','M']})
df2

  name gender
0    A      M
1    B      F
2    D      M

In [17]:
pd.merge(df1,df2)

  name  age gender
0    A   20      M
1    B   30      F

In [19]:
pd.merge(df1,df2,how='right')

  name   age gender
0    A  20.0      M
1    B  30.0      F
2    D   NaN      M

In [23]:
pd.merge(df1,df2,how='outer')

  name   age gender
0    A  20.0      M
1    B  30.0      F
2    C  25.0    NaN
3    D   NaN      M

In [24]:
df1 = pd.DataFrame({'name' : ['A','B','C'],'age':[20,30,25]})
s1 = pd.Series(['M','F','M'],name ='Gender')
df1,s1

(  name  age
 0    A   20
 1    B   30
 2    C   25,
 0    M
 1    F
 2    M
 Name: Gender, dtype: object)

In [25]:
df1.join(s1)

  name  age Gender
0    A   20      M
1    B   30      F
2    C   25      M

In [26]:
df1 = pd.DataFrame({'name' : ['A','B','C','Z'],'age':[20,30,25,80]})
df1

  name  age
0    A   20
1    B   30
2    C   25
3    Z   80

In [27]:
df2 = pd.DataFrame({'name' : ['A','B','C','D'],'gender':['M','M','F','M']})
df2

  name gender
0    A      M
1    B      M
2    C      F
3    D      M

In [29]:
df1.set_index('name').join(df2.set_index('name'))

      age gender
name
A      20      M
B      30      M
C      25      F
Z      80    NaN